---
kind: type
id: T:Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData
source: html/6029f894-5a16-522b-8759-57b4e3475952.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData

Represents the data and parameters of electrical analytical transfer switch.

## Syntax (C#)
```csharp
public class AnalyticalTransferSwitchData : AnalyticalDistributionNodePropertyData
```